In [1]:
#import libraries
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [2]:
#Reading the csv file from the directory
dataset = pd.read_csv("Social_Network_Ads.csv")

In [3]:
#printing the dataset
dataset

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [5]:
#eliminating the duplicates
dataset = pd.get_dummies(dataset,drop_first=True)

In [6]:
#printing the updated dataset
dataset

      User ID  Age  EstimatedSalary  Purchased  Gender_Male
0    15624510   19            19000          0            1
1    15810944   35            20000          0            1
2    15668575   26            43000          0            0
3    15603246   27            57000          0            0
4    15804002   19            76000          0            1
..        ...  ...              ...        ...          ...
395  15691863   46            41000          1            0
396  15706071   51            23000          1            1
397  15654296   50            20000          1            0
398  15755018   36            33000          0            1
399  15594041   49            36000          1            0

[400 rows x 5 columns]

In [7]:
#renaming the dataset
dataset.rename(columns={"Gender_Male":"Gender"},inplace=True)

In [9]:
#printing the updated dataset
dataset

      User ID  Age  EstimatedSalary  Purchased  Gender
0    15624510   19            19000          0       1
1    15810944   35            20000          0       1
2    15668575   26            43000          0       0
3    15603246   27            57000          0       0
4    15804002   19            76000          0       1
..        ...  ...              ...        ...     ...
395  15691863   46            41000          1       0
396  15706071   51            23000          1       1
397  15654296   50            20000          1       0
398  15755018   36            33000          0       1
399  15594041   49            36000          1       0

[400 rows x 5 columns]

In [10]:
#droping the column "User ID"
dataset=dataset.drop("User ID",axis=1)

In [11]:
#printing the updated dataset
dataset

     Age  EstimatedSalary  Purchased  Gender
0     19            19000          0       1
1     35            20000          0       1
2     26            43000          0       0
3     27            57000          0       0
4     19            76000          0       1
..   ...              ...        ...     ...
395   46            41000          1       0
396   51            23000          1       1
397   50            20000          1       0
398   36            33000          0       1
399   49            36000          1       0

[400 rows x 4 columns]

In [12]:
#printing the columns in dataset
dataset.columns

Index(['Age', 'EstimatedSalary', 'Purchased', 'Gender'], dtype='object')

In [13]:
#separating the purchased and non-purchased details
dataset["Purchased"].value_counts()

0    257
1    143
Name: Purchased, dtype: int64

In [14]:
#separating the independent and target values from dataset
independent = dataset[["Age","EstimatedSalary","Gender"]]
target = dataset[["Purchased"]]

In [15]:
#printing the separated independent and target values
independent,target

(     Age  EstimatedSalary  Gender
 0     19            19000       1
 1     35            20000       1
 2     26            43000       0
 3     27            57000       0
 4     19            76000       1
 ..   ...              ...     ...
 395   46            41000       0
 396   51            23000       1
 397   50            20000       0
 398   36            33000       1
 399   49            36000       0

 [400 rows x 3 columns],
      Purchased
 0            0
 1            0
 2            0
 3            0
 4            0
 ..         ...
 395          1
 396          1
 397          1
 398          0
 399          1

 [400 rows x 1 columns])

In [16]:
#separating the train and test set values from dataset.
from sklearn.model_selection import train_test_split
X_train,X_test,Y_train,Y_test = train_test_split(independent,target,test_size=0.33,random_state=42)

In [19]:
#printing the train and test values
(X_train,X_test),(Y_train,Y_test)

((     Age  EstimatedSalary  Gender
  258   58            95000       0
  177   25            22000       1
  119   41            59000       1
  194   28            89000       1
  229   42            80000       0
  ..   ...              ...     ...
  71    24            27000       0
  106   26            35000       0
  270   43           133000       0
  348   39            77000       1
  102   32            86000       0

  [268 rows x 3 columns],
       Age  EstimatedSalary  Gender
  209   46            22000       0
  280   59            88000       0
  33    28            44000       0
  210   48            96000       0
  93    29            28000       0
  ..   ...              ...     ...
  332   42            65000       1
  167   35            71000       0
  245   51           146000       0
  311   39            96000       1
  145   24            89000       0

  [132 rows x 3 columns]),
 (     Purchased
  258          1
  177          0
  119          0
  194          0
  229          1
  ..         ...
  71           0
  106          0
  270          0
  348          0
  102          0

  [268 rows x 1 columns],
       Purchased
  209          0
  280          1
  33           0
  210          1
  93           0
  ..         ...
  332          0
  167          0
  245          1
  311          1
  145          0

  [132 rows x 1 columns]))

In [17]:
#printing the rows and columns in train and test set
X_train.shape,X_test.shape

((268, 3), (132, 3))

In [18]:
Y_train.shape,Y_test.shape

((268, 1), (132, 1))

In [21]:
#creating and training the model
from sklearn.tree import DecisionTreeClassifier
clf_model = DecisionTreeClassifier(criterion = "entropy", random_state=0)
clf_model.fit(X_train,Y_train)

DecisionTreeClassifier(criterion='entropy', random_state=0)

In [23]:
#prediction value is calculated based on the test set values
Y_pred = clf_model.predict(X_test)

In [24]:
#printing the predicted value
Y_pred

array([1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0,
       1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1,
       0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1,
       1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1,
       0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0,
       0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0])

In [25]:
#Evaluation metrics for classification using confusion matrix
from sklearn.metrics import confusion_matrix
conf_mx = confusion_matrix(Y_test,Y_pred)

In [26]:
#printing the metrics
conf_mx

array([[71,  9],
       [ 9, 43]])

In [27]:
from sklearn.metrics import classification_report
clf_report = classification_report(Y_test,Y_pred)

In [30]:
print(clf_report)

              precision    recall  f1-score   support

           0       0.89      0.89      0.89        80
           1       0.83      0.83      0.83        52

    accuracy                           0.86       132
   macro avg       0.86      0.86      0.86       132
weighted avg       0.86      0.86      0.86       132